Documents/ЗаявленияПоЭлДокументооборотуСПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗаявленияПоЭлДокументооборотуСПФР</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресФактический</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаявленийНаЭДОВПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганыПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отпечаток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеАбонентаСпецоператораСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОператорРегНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОператорНаименованиеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОператорНаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОператорИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОператорКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыВладельцевЭЦП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыВладельцевЭЦП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДругойСотрудник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЗаявленийНаЭДОВПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыЗаявленийНаЭДОВПФР</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаПодключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаОтключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпецоператорыСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СпецоператорыСвязи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КалугаАстрал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Такском</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Форус</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявленияПоЭлДокументооборотуСПФР/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ВыгрузитьЗаявление(Заявление) Экспорт
	
	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	Если КонтекстЭДОСервер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат КонтекстЭДОСервер.ВыгрузитьЗаявленияПоЭлДокументооборотуСПФР(Заявление);
	
КонецФункции

Функция ПолучательЗаявления(Организация) Экспорт

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Именно так определяется код ПФ при отправке заявления и отчетов в ПФР
	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	Возврат КонтекстЭДОСервер.ОпределитьОрганПФРОрганизации(Организация);
	
КонецФункции

Процедура ЗаполнитьИзБазы(Объект) Экспорт

	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	
	СтруктураРеквизитов = Новый Структура();
	СтруктураРеквизитов.Вставить("Организация", Объект.Организация);
	СтруктураРеквизитов.Вставить("ПриОткрытии", Истина);
	СтруктураРеквизитов.Вставить("АдресЮридический",);
	СтруктураРеквизитов.Вставить("АдресФактический",);
	
	КонтекстЭДОСервер.ЗаполнитьДанныеОрганизации(СтруктураРеквизитов);
	ДанныеОрганизацииИОтветственныхЛиц = КонтекстЭДОСервер.ДополнитьДанныеОрганизацииДаннымиПоОтветственнымЛицам(СтруктураРеквизитов);
	ДанныеОрганизации = ДанныеОрганизацииИОтветственныхЛиц.СтруктураДанныхОрганизации;

	ЭтоЮридическоеЛицо = РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(Объект.Организация);
	
	Если ЭтоЮридическоеЛицо Тогда
		Объект.НаименованиеКраткое = ДанныеОрганизации.КраткоеНаименование;
		Объект.НаименованиеПолное  = ДанныеОрганизации.НаимЮЛПол;
		Объект.КПП = ДанныеОрганизации.КППЮЛ;
	КонецЕсли;
	
	Объект.РегНомерПФР	= ДанныеОрганизации.РегНомПФР;
	Объект.ИНН = ДанныеОрганизации.ИННЮЛ;
	
	Объект.АдресРегистрации = ДанныеОрганизацииИОтветственныхЛиц.АдресЮридическийЗначение;
	Объект.АдресФактический = ДанныеОрганизацииИОтветственныхЛиц.АдресФактическийЗначение;
	
	Объект.ЭлектроннаяПочта = ДанныеОрганизации.ЭлектроннаяПочта;
	Руководитель = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПереопределяемый.Руководитель(Объект.Организация); 
	
	Если ЗначениеЗаполнено(Руководитель) Тогда
		
		ДанныеСотрудника = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ПолучитьДанныеСотрудника(
			Перечисления.ТипыВладельцевЭЦП.Руководитель,
			ДанныеОрганизации,
			Руководитель);
			
		Объект.Имя       = ДанныеСотрудника.ФИО.Имя;
		Объект.Фамилия   = ДанныеСотрудника.ФИО.Фамилия;
		Объект.Отчество  = ДанныеСотрудника.ФИО.Отчество;
		
		Если ЭтоЮридическоеЛицо Тогда
			Объект.Должность = ДанныеСотрудника.Должность;
		Иначе
			Объект.Должность = НСтр("ru = 'Индивидуальный предприниматель'");
		КонецЕсли;
		
		Объект.СНИЛС     = ДанныеСотрудника.СНИЛС;
		
		ПередставлениеТелефона = ЭлектроннаяПодписьВМоделиСервисаКлиентСервер.ПолучитьПредставлениеТелефона(ДанныеСотрудника.ТелефонРабочий); 
		Если ПередставлениеТелефона = "" Тогда
			Объект.Телефон = ДанныеСотрудника.ТелефонРабочий;
		Иначе
			Объект.Телефон = ПередставлениеТелефона;
		КонецЕсли;

	КонецЕсли;
	
	Объект.Получатель = ПолучательЗаявления(Объект.Организация);
	
КонецПроцедуры

Функция ПечатнаяФорма(Заявление) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Если Заявление.Вид = Перечисления.ВидыЗаявленийНаЭДОВПФР.НаПодключение
		ИЛИ Заявление.Вид = Перечисления.ВидыЗаявленийНаЭДОВПФР.НаОтключение Тогда
		
		КонтекстЭДОСервер     = ДокументооборотСКО.ПолучитьОбработкуЭДО();
		ДействуетФорматАФ245д = КонтекстЭДОСервер.ДействуетФорматАФ245д();
		
		Если ДействуетФорматАФ245д Тогда
			Бланк = Документы.ЗаявленияПоЭлДокументооборотуСПФР.ПолучитьМакет("ЗаявлениеАФ_2_45д");
		Иначе
			Бланк = Документы.ЗаявленияПоЭлДокументооборотуСПФР.ПолучитьМакет("ЗаявлениеАФ_2_41д");
		КонецЕсли;
		
		ЗаполнитьШапку(Заявление, ТабДокумент, Бланк, ДействуетФорматАФ245д);
		ЗаполнитьИпИОрганизацию(Заявление, ТабДокумент, Бланк, ДействуетФорматАФ245д);
		ЗаполнитьОператора(Заявление, ТабДокумент, Бланк, ДействуетФорматАФ245д);
		ЗаполнитьПодвал(Заявление, ТабДокумент, Бланк);
		
	КонецЕсли;
	
	ЗаполнитьПодпись(Заявление, ТабДокумент);
	
	ТабДокумент.МасштабПечати = 100;
	Возврат ТабДокумент;
	
КонецФункции

Функция ПараметрыЗаполненияОператора(Организация, Вид) Экспорт
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ОператорРегНомерПФР", "");
	ДополнительныеПараметры.Вставить("ОператорНаименованиеПолное", "");
	ДополнительныеПараметры.Вставить("ОператорНаименованиеКраткое", "");
	ДополнительныеПараметры.Вставить("ОператорИНН", "");
	ДополнительныеПараметры.Вставить("ОператорКПП", "");
	
	УказанаОрганизация    = ЗначениеЗаполнено(Организация);
	
	Если УказанаОрганизация Тогда
		
		КонтекстЭДОСервер     = ДокументооборотСКО.ПолучитьОбработкуЭДО();
		ДействуетФорматАФ245д = КонтекстЭДОСервер.ДействуетФорматАФ245д();
		
		УчетнаяЗапись     = КонтекстЭДОСервер.УчетнаяЗаписьОрганизации(Организация);
		ЕстьУчетнаяЗапись = ЗначениеЗаполнено(УчетнаяЗапись);
		ЕстьОператор      = ЕстьУчетнаяЗапись И ЗначениеЗаполнено(УчетнаяЗапись.СпецоператорСвязи);
		
		ЭтоКалуга = ЕстьУчетнаяЗапись И ЕстьОператор
			И УчетнаяЗапись.СпецоператорСвязи = Перечисления.СпецоператорыСвязи.КалугаАстрал;
			
		ЭтоФорус = ЕстьУчетнаяЗапись И ЕстьОператор
			И УчетнаяЗапись.СпецоператорСвязи = Перечисления.СпецоператорыСвязи.Форус;
			
		ЭтоТакском = ЕстьУчетнаяЗапись И ЕстьОператор
			И УчетнаяЗапись.СпецоператорСвязи = Перечисления.СпецоператорыСвязи.Такском;
			
		ЭтоНужныйОператор = ЭтоКалуга ИЛИ ЭтоФорус ИЛИ ЭтоТакском;
		
		Если ЭтоНужныйОператор Тогда
			
			УчетнаяЗапись = УчетнаяЗапись;
			
			ДополнительныеПараметры["ОператорРегНомерПФР"] = УчетнаяЗапись.ОператорРегНомерПФР;
			ДополнительныеПараметры["ОператорНаименованиеПолное"] = УчетнаяЗапись.ОператорНаименованиеПолное;
			ДополнительныеПараметры["ОператорНаименованиеКраткое"] = УчетнаяЗапись.ОператорНаименованиеКраткое;
			ДополнительныеПараметры["ОператорИНН"] = УчетнаяЗапись.ОператорИНН;
			ДополнительныеПараметры["ОператорКПП"] = УчетнаяЗапись.ОператорКПП;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнятьВручную =
		НЕ ЗначениеЗаполнено(ДополнительныеПараметры.ОператорРегНомерПФР)
		ИЛИ НЕ ЗначениеЗаполнено(ДополнительныеПараметры.ОператорНаименованиеПолное) И НЕ ДействуетФорматАФ245д
		ИЛИ НЕ ЗначениеЗаполнено(ДополнительныеПараметры.ОператорНаименованиеКраткое)
		ИЛИ НЕ ЗначениеЗаполнено(ДополнительныеПараметры.ОператорИНН)
		ИЛИ НЕ ЗначениеЗаполнено(ДополнительныеПараметры.ОператорКПП);
		
	ДополнительныеПараметры.Вставить("ЗаполнятьВручную", ЗаполнятьВручную);
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	// инициализируем контекст ЭДО - модуль обработки
	ТекстСообщения = "";
	КонтекстЭДО = ДокументооборотСКО.ПолучитьОбработкуЭДО(ТекстСообщения);
	Если КонтекстЭДО = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	КонтекстЭДО.ОбработкаПолученияФормы("Документ", "ЗаявленияПоЭлДокументооборотуСПФР", ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьШапку(Заявление, ТабДокумент, Бланк, ДействуетФорматАФ245д)
	
 	ОбластьШапка = Бланк.ПолучитьОбласть("Шапка");
	
	Если Заявление.Вид = Перечисления.ВидыЗаявленийНаЭДОВПФР.НаПодключение Тогда
		
		ОбластьШапка.Параметры.Заголовок = НСтр("ru = 'Заявление на подключение страхователя к электронному документообороту ПФР'");
		ОбластьШапка.Параметры.Текст = НСтр("ru = 'Прошу подключить в качестве участника электронного документооборота Пенсионного фонда Российской Федерации по телекоммуникационным каналам связи через Оператора.'");
		
	ИначеЕсли Заявление.Вид = Перечисления.ВидыЗаявленийНаЭДОВПФР.НаОтключение Тогда
		
		ОбластьШапка.Параметры.Заголовок = НСтр("ru = 'Заявление на отключение страхователя от электронного документооборота ПФР'");
		
		Если ДействуетФорматАФ245д Тогда
			ОбластьШапка.Параметры.Текст = НСтр("ru = 'Прошу отключить от электронного документооборота Пенсионного фонда Российской Федерации по телекоммуникационным каналам связи через Оператора, указанного ниже.'");
		Иначе
			ОбластьШапка.Параметры.Текст = НСтр("ru = 'Прошу отключить от электронного документооборота Пенсионного фонда Российской Федерации по телекоммуникационным каналам связи через Оператора.'");
		КонецЕсли;
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьШапка);
	
КонецПроцедуры

Процедура ЗаполнитьИпИОрганизацию(Заявление, ТабДокумент, Бланк, ДействуетФорматАФ245д)
	
	ЭтоЮридическоеЛицо = РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(Заявление.Организация);
	ОбластьОрганизация = Бланк.ПолучитьОбласть("Организация");
	ОбластьИП          = Бланк.ПолучитьОбласть("ИП");
	
	Если ЭтоЮридическоеЛицо Тогда
		ОбластьОрганизация.Параметры.Заполнить(Заявление);
		Если НЕ ДействуетФорматАФ245д Тогда
			ОбластьОрганизация.Параметры.АдресРегистрацииПредставление = ПредставлениеАдреса(Заявление.АдресРегистрации);
			ОбластьОрганизация.Параметры.АдресФактическийПредставление = ПредставлениеАдреса(Заявление.АдресФактический);
		КонецЕсли;
	Иначе
		ОбластьИП.Параметры.Заполнить(Заявление);
		Если НЕ ДействуетФорматАФ245д Тогда
			ОбластьИП.Параметры.АдресРегистрацииПредставление = ПредставлениеАдреса(Заявление.АдресРегистрации);
		КонецЕсли;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьОрганизация);
	ТабДокумент.Вывести(ОбластьИП);

КонецПроцедуры

Процедура ЗаполнитьОператора(Заявление, ТабДокумент, Бланк, ДействуетФорматАФ245д)
	
	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	
	Если Заявление.Вид = Перечисления.ВидыЗаявленийНаЭДОВПФР.НаПодключение И НЕ ДействуетФорматАФ245д 
		ИЛИ ДействуетФорматАФ245д Тогда
	
		ОбластьОператор = Бланк.ПолучитьОбласть("Оператор");
		ОбластьОператор.Параметры.Заполнить(Заявление);
		ТабДокумент.Вывести(ОбластьОператор);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПодвал(Заявление, ТабДокумент, Бланк)
	
	ОбластьПодвал = Бланк.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(Заявление);
	
	ФИО = Новый Структура();
	ФИО.Вставить("Фамилия", 	Заявление.Фамилия);
	ФИО.Вставить("Имя", 		Заявление.Имя);
	ФИО.Вставить("Отчество", 	Заявление.Отчество);
	
	Руководитель = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИО);
	
	ОбластьПодвал.Параметры.ФИО = Руководитель;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
КонецПроцедуры

Процедура ЗаполнитьПодпись(Заявление, ТабДокумент)
	
	ТипыСообщений = Новый Массив;
	ТипыСообщений.Добавить(Перечисления.ТипыТранспортныхСообщений.ПервичноеСообщениеСодержащееОтчетностьПФР);
	ТипыСообщений.Добавить(Перечисления.ТипыТранспортныхСообщений.ПротоколПФР);
	
	//"ПротоколПФР" - Уведомления о результате рассмотрения,
	//"ПодтверждениеПолученияОтчетностиПФР" - Уведомления о доставке,
	//"УведомлениеОбОшибкеПФР"
	
	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	КонтекстЭДОСервер.ДобавитьШтампПодписиПодДокументом(
		Заявление,
		ТипыСообщений,
		ТабДокумент,
		2,
		Ложь); 

КонецПроцедуры

Функция ПредставлениеАдреса(ЗначениеАдреса) Экспорт
	
	ЭтоАдресПоФИАСу = УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(ЗначениеАдреса);
	Если ЭтоАдресПоФИАСу Тогда
		Возврат УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(ЗначениеАдреса);
	Иначе
		Возврат РегламентированнаяОтчетностьКлиентСервер.ПредставлениеАдресаВФормате9Запятых(ЗначениеАдреса, Истина);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
